ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/LIN_LIN_52400000h.xml
	<bitfield id="SETWAKEUPINT" width="1" begin="1" end="1" resetval="0x0" description="Set wake-up interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN to generate a wake-up interrupt and thereby exit low-power mode. The wake-up interrupt is asserted on falling edge of the wake-up pulse. If enabled, the wake-up interrupt is asserted when local low-power mode is requested while the receiver is busy or if a low level is detected on the SCIRX pin during low-power mode. Wake-up interrupt is not asserted upon a wakeup pulse if the module is not in power down mode. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled." range="1" rwaccess="R/W1TS"/>
	<bitfield id="SETBRKDTINT" width="1" begin="0" end="0" resetval="0x0" description="Set break-detect interrupt.This bit is effective in SCI-compatible mode only. Setting this bit enables the SCI/LIN to generate an interrupt if a break condition is detected on the LINRX pin. This field is writable in SCI mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled." range="0" rwaccess="R/W1TS"/>
	</register><register id="LIN_SCICLEARINT" acronym="LIN_SCICLEARINT" offset="16" width="32" description="The SCICLEARINT register is used to disable the enabled interrupts without accessing the SCISETINT register.">
		<bitfield id="CLRBEINT" width="1" begin="31" end="31" resetval="0x0" description="Clear Bit Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the bit error interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="31" rwaccess="R/W1TC"/>
	<bitfield id="CLRPBEINT" width="1" begin="30" end="30" resetval="0x0" description="Clear Physical Bus Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the physical-bus error interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="30" rwaccess="R/W1TC"/>
	<bitfield id="CLRCEINT" width="1" begin="29" end="29" resetval="0x0" description="Clear checksum-error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the checksum-error interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="29" rwaccess="R/W1TC"/>
	<bitfield id="CLRISFEINT" width="1" begin="28" end="28" resetval="0x0" description="Clear Inconsistent-Sync-Field-Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the ISFE interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="28" rwaccess="R/W1TC"/>
	<bitfield id="CLRNREINT" width="1" begin="27" end="27" resetval="0x0" description="Clear No-Reponse-Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the no-response error interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="27" rwaccess="R/W1TC"/>
	<bitfield id="CLRFEINT" width="1" begin="26" end="26" resetval="0x0" description="Clear Framing-Error Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables framing-error interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="26" rwaccess="R/W1TC"/>
	<bitfield id="CLROEINT" width="1" begin="25" end="25" resetval="0x0" description="Clear Overrun-Error Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the overrun interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="25" rwaccess="R/W1TC"/>
	<bitfield id="CLRPEINT" width="1" begin="24" end="24" resetval="0x0" description="Clear Parity Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the parity error interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="24" rwaccess="R/W1TC"/>
	<bitfield id="SETRXDMA" width="1" begin="17" end="17" resetval="0x0" description="Clear receiver DMA.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the receive DMA request. 0      Receiver DMA request is disabled. Writing a       0 to this bit has no effect.1      Receiver DMA request is enabled. Writing a       1 to this bit will disable the DMA request       and clear this bit." range="17" rwaccess="R/W1TC"/>
	<bitfield id="CLRTXDMA" width="1" begin="16" end="16" resetval="0x0" description="Clear transmit DMA.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the transmit DMA request. 0      Transmit DMA request is disabled. Writing a       0 to this bit has no effect.1      Transmit DMA request is enabled. Writing a       1 to this bit will disable the DMA request       and clear this bit." range="16" rwaccess="R/W1TC"/>
	<bitfield id="CLRIDINT" width="1" begin="13" end="13" resetval="0x0" description="Clear Identifier interrupt.This bit is effective in LIN mode only. Setting this bit disables the ID interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="13" rwaccess="R/W1TC"/>
	<bitfield id="CLRRXINT" width="1" begin="9" end="9" resetval="0x0" description="Clear Receiver interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the receiver interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="9" rwaccess="R/W1TC"/>
	<bitfield id="CLRTXINT" width="1" begin="8" end="8" resetval="0x0" description="Clear Transmitter interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the transmitter interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="8" rwaccess="R/W1TC"/>
	<bitfield id="CLRTOA3WUSINT" width="1" begin="7" end="7" resetval="0x0" description="Clear Timeout After 3 Wakeup Signals interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout after 3 wakeup signals interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="7" rwaccess="R/W1TC"/>
	<bitfield id="CLRTOAWUSINT" width="1" begin="6" end="6" resetval="0x0" description="Clear Timeout After Wakeup Signal interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout after one wakeup signal interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="6" rwaccess="R/W1TC"/>
	<bitfield id="CLRTIMEOUTINT" width="1" begin="4" end="4" resetval="0x0" description="Clear Timeout interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout [LIN bus idle] interrupt. This field is writable in LIN mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="4" rwaccess="R/W1TC"/>
	<bitfield id="CLRWAKEUPINT" width="1" begin="1" end="1" resetval="0x0" description="Clear Wake-up interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the wake-up interrupt. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="1" rwaccess="R/W1TC"/>
	<bitfield id="CLRBRKDTINT" width="1" begin="0" end="0" resetval="0x0" description="Clear Break-detect interrupt.This bit is effective in SCI-compatible mode only. Setting this bit disables the Break-detect interrupt. This field is writable in SCI mode only. 0      Interrupt is disabled. Writing a 0 to this       bit has no effect.1      Interrupt is enabled. Writing a 1 to this       bit will disable the interrupt and clear       this bit." range="0" rwaccess="R/W1TC"/>
	</register><register id="LIN_SCISETINTLVL" acronym="LIN_SCISETINTLVL" offset="20" width="32" description="The SCISETINTLVL register is used to map individual interrupt sources to the INT1 interrupt line.">
		<bitfield id="SETBEINTLVL" width="1" begin="31" end="31" resetval="0x0" description="Set Bit Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Bit Error interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="31" rwaccess="R/W1TS"/>
	<bitfield id="SETPBEINTLVL" width="1" begin="30" end="30" resetval="0x0" description="Set Physical Bus Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Physical Bus Error interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="30" rwaccess="R/W1TS"/>
	<bitfield id="SETCEINTLVL" width="1" begin="29" end="29" resetval="0x0" description="Set Checksum-error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Checksum-error interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="29" rwaccess="R/W1TS"/>
	<bitfield id="SETISFEINTLVL" width="1" begin="28" end="28" resetval="0x0" description="Set Inconsistent-Sync-Field-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Inconsistent-Sync-Field-Error interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="28" rwaccess="R/W1TS"/>
	<bitfield id="SETNREINTLVL" width="1" begin="27" end="27" resetval="0x0" description="Set No-Reponse-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the No-Response-Error interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="27" rwaccess="R/W1TS"/>
	<bitfield id="SETFEINTLVL" width="1" begin="26" end="26" resetval="0x0" description="Set Framing-Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Framing-Error interrupt level to the INT1 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="26" rwaccess="R/W1TS"/>
	<bitfield id="SETOEINTLVL" width="1" begin="25" end="25" resetval="0x0" description="Set Overrun-Error Interrupt Level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Overrun-Error interrupt level to the INT1 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="25" rwaccess="R/W1TS"/>
	<bitfield id="SETPEINTLVL" width="1" begin="24" end="24" resetval="0x0" description="Set Parity Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Parity error interrupt level to the INT1 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="24" rwaccess="R/W1TS"/>
	<bitfield id="SETIDINTLVL" width="1" begin="13" end="13" resetval="0x0" description="Set ID interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the ID interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="13" rwaccess="R/W1TS"/>
	<bitfield id="SETRXINTOVO" width="1" begin="9" end="9" resetval="0x0" description="Set Receiver interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the receiver interrupt level to the INT1 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="9" rwaccess="R/W1TS"/>
	<bitfield id="SETTXINTLVL" width="1" begin="8" end="8" resetval="0x0" description="Set Transmitter interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the transmitter interrupt level to the INT1 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="8" rwaccess="R/W1TS"/>
	<bitfield id="SETTOA3WUSINTLVL" width="1" begin="7" end="7" resetval="0x0" description="Set Timeout After 3 Wakeup Signals interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout after 3 wakeup signals interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SETTOAWUSINTLVL" width="1" begin="6" end="6" resetval="0x0" description="Set Timeout After Wakeup Signal interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the the timeout after wakeup interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="6" rwaccess="R/W1TS"/>
	<bitfield id="SETTIMEOUTINTLVL" width="1" begin="4" end="4" resetval="0x0" description="Set Timeout interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout interrupt level to the INT1 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SETWAKEUPINTLVL" width="1" begin="1" end="1" resetval="0x0" description="Set Wake-up interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Wake-up interrupt level to the INT1 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="1" rwaccess="R/W1TS"/>
	<bitfield id="SETBRKDTINTLVL" width="1" begin="0" end="0" resetval="0x0" description="Set Break-detect interrupt level.This bit is effective in SCI-compatible mode only. Writing to this bit maps the Break-detect interrupt level to the INT1 line. This field is writable in SCI mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line." range="0" rwaccess="R/W1TS"/>
	</register><register id="LIN_SCICLEARINTLVL" acronym="LIN_SCICLEARINTLVL" offset="24" width="32" description="The SCICLEARINTLVL register is used to map individual interrupt sources to the INT0 line.">
		<bitfield id="CLRBEINTLVL" width="1" begin="31" end="31" resetval="0x0" description="Clear Bit Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Bit Error interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="31" rwaccess="R/W1TC"/>
	<bitfield id="CLRPBEINTLVL" width="1" begin="30" end="30" resetval="0x0" description="Clear Physical Bus Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Physical Bus Error interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="30" rwaccess="R/W1TC"/>
	<bitfield id="CLRCEINTLVL" width="1" begin="29" end="29" resetval="0x0" description="Clear Checksum-error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Checksum-error interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="29" rwaccess="R/W1TC"/>
	<bitfield id="CLRISFEINTLVL" width="1" begin="28" end="28" resetval="0x0" description="Clear Inconsistent-Sync-Field-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Inconsistent-Sync-Field-Error interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="28" rwaccess="R/W1TC"/>
	<bitfield id="CLRNREINTLVL" width="1" begin="27" end="27" resetval="0x0" description="Clear No-Reponse-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the No-Response-Error interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="27" rwaccess="R/W1TC"/>
	<bitfield id="CLRFEINTLVL" width="1" begin="26" end="26" resetval="0x0" description="Clear Framing-Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Framing-Error interrupt level to the INT0 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="26" rwaccess="R/W1TC"/>
	<bitfield id="CLROEINTLVL" width="1" begin="25" end="25" resetval="0x0" description="Clear Overrun-Error Interrupt Level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Overrun-Error interrupt level to the INT0 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="25" rwaccess="R/W1TC"/>
	<bitfield id="CLRPEINTLVL" width="1" begin="24" end="24" resetval="0x0" description="Clear Parity Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Parity Error interrupt level to the INT0 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="24" rwaccess="R/W1TC"/>
	<bitfield id="CLRIDINTLVL" width="1" begin="13" end="13" resetval="0x0" description="Clear ID interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the ID interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="13" rwaccess="R/W1TC"/>
	<bitfield id="CLRRXINTLVL" width="1" begin="9" end="9" resetval="0x0" description="Clear Receiver interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the receiver interrupt level to the INT0 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="9" rwaccess="R/W1TC"/>
	<bitfield id="CLRTXINTLVL" width="1" begin="8" end="8" resetval="0x0" description="Clear Transmitter interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the transmitter interrupt level to the INT0 line. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="8" rwaccess="R/W1TC"/>
	<bitfield id="CLRTOA3WUSINTLVL" width="1" begin="7" end="7" resetval="0x0" description="Clear Timeout After 3 Wakeup Signals interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout after 3 wakeup signals interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="7" rwaccess="R/W1TC"/>
	<bitfield id="CLRTOAWUSINTLVL" width="1" begin="6" end="6" resetval="0x0" description="Clear Timeout After Wakeup Signal interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the the timeout after wakeup interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="6" rwaccess="R/W1TC"/>
	<bitfield id="CLRTIMEOUTINTLVL" width="1" begin="4" end="4" resetval="0x0" description="Clear Timeout interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout interrupt level to the INT0 line. This field is writable in LIN mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="4" rwaccess="R/W1TC"/>
	<bitfield id="CLRWAKEUPINTLVL" width="1" begin="1" end="1" resetval="0x0" description="Clear Wake-up interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Wake-up interrupt level to the INT0 line. 0      Interrupt level mapped to INT0 line.       Writing a 0 to this bit has no effect.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="1" rwaccess="R/W1TC"/>
	<bitfield id="CLRBRKDTINTLVL" width="1" begin="0" end="0" resetval="0x0" description="Clear Break-detect interrupt level.This bit is effective in SCI-compatible mode only. Writing to this bit maps the Break-detect interrupt level to the INT0 line. This field is writable in SCI mode only. 0      Interrupt level mapped to INT0 line.1      Interrupt level mapped to INT1 line.       Writing a 1 to this bit will map the       interrupt to INT0 and clear this bit." range="0" rwaccess="R/W1TC"/>
