ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/LIN_LIN_52400000h.xml
	<bitfield id="SCI_LIN_PSL" width="16" begin="15" end="0" resetval="0x0" description="PRESCALER P [Low Bits].SCI/LIN 24-bit Integer Prescaler Selection.These bits are used to select a baudrate for the SCI/LIN module. These bits are effective in LIN mode and SCI compatible mode. The SCI/LIN has an internally generated serial clock determined by the LIN module input clock and the prescalers P and M in this register. The SCI/LIN uses the 24-bit integer prescaler P value to select 1 of over 16,700,000 available baud rates. The additional 4-bit fractional prescaler M refines the baudate selection." range="15:0" rwaccess="R/W"/>
	</register><register id="LIN_SCIED" acronym="LIN_SCIED" offset="48" width="32" description="The SCIED register is a duplicate copy of SCIRD register that has no effect on the RXRDY flag for use with an emulator.">
		<bitfield id="ED" width="8" begin="7" end="0" resetval="0x0" description="Receiver Emulation Data.This bit is effective in SCI-compatible mode only. Reading SCIED[7-0] does not clear the RXRDY flag. This register should be used only by an emulator that must continually read the data buffer without affecting the RXRDY flag." range="7:0" rwaccess="R"/>
	</register><register id="LIN_SCIRD" acronym="LIN_SCIRD" offset="52" width="32" description="The SCIRD register is where received data is stored and can be read from.">
		<bitfield id="RD" width="8" begin="7" end="0" resetval="0x0" description="Received Data.This bit is effective in SCI-compatible mode only. When a frame has been completely received, the data in the frame is transferred from the receiver shift register SCIRXSHF to this register. As this transfer occurs, the RXRDY flag is set and a receive interrupt is generated if RX INT ENA [SCISETINT0.9] is set. When the data is read from SCIRD, the RXRDY flag is automatically cleared. When the SCI receives data that is fewer than eight bits in length, it loads the data into this register in a left justified format padded with trailing zeros. Therefore, your software should perform a logical shift on the data by the correct number of positions to make it right justified." range="7:0" rwaccess="R"/>
	</register><register id="LIN_SCITD" acronym="LIN_SCITD" offset="56" width="32" description="The SCITD register is where data to be transmitted is written to by application software.">
		<bitfield id="TD" width="8" begin="7" end="0" resetval="0x0" description="Transmit dataThis bit is effective in SCI-compatible mode only. Data to be transmitted is written to this register. The transfer of data from this register to the transmit shift register SCITXSHF sets the TXRDY flag [SCIFLR.23], which indicates that SCITD is ready to be loaded with another byte of data. Note: If TX INT ENA [SCISETINT.8] is set, this data transfer also causes an interrupt. Note: Data written to the SCIRD register that is fewer than eight bits long must be right justified, but it does not need to be padded with leading zeros. " range="7:0" rwaccess="R/W"/>
	</register><register id="LIN_SCIPIO0" acronym="LIN_SCIPIO0" offset="60" width="32" description="The SCIPIO0 register is used to enable the LINTX and LINRX pins.">
		<bitfield id="TXFUNC" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin function.This bit is effective in LIN or SCI mode. This bit defines the function of LINTX pin. 0      LINTX pin is disabled.1      LINTX pin is enabled." range="2" rwaccess="R/W"/>
	<bitfield id="RXFUNC" width="1" begin="1" end="1" resetval="0x0" description="Receive pin function.This bit is effective in LIN or SCI mode. This bit defines the function of the LINRX pin. 0      LINRX pin is disabled.1      LINRX pin is enabled." range="1" rwaccess="R/W"/>
	</register><register id="LIN_SCIPIO1" acronym="LIN_SCIPIO1" offset="64" width="32" description="Pin control Register 1">
		<bitfield id="TXDIR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin direction.This bit is effective in LIN or SCI mode. This bit determines the data direction on the LINTX pin if it is configured with general-purpose I/O functionality [TX FUNC = 0].0:general purpose input pin.1:general-purpose output pin" range="2" rwaccess="R/W"/>
	<bitfield id="RXDIR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin direction.This bit is effective in LIN or SCI mode. This bit determines the data direction on the LINRX pin if it is configured with general-purpose I/O functionality [RX FUNC = 0].0:general purpose input pin.1:general-purpose output pin" range="1" rwaccess="R/W"/>
	</register><register id="LIN_SCIPIO2" acronym="LIN_SCIPIO2" offset="68" width="32" description="The SCIPIO2 register indicates the current status of the LINTX and LINRX pins.">
		<bitfield id="TXIN" width="1" begin="2" end="2" resetval="0x0" description="Transmit data in.This bit is effective in LIN or SCI-compatible mode. This bit contains the current value on the LINTX pin." range="2" rwaccess="R"/>
	<bitfield id="RXIN" width="1" begin="1" end="1" resetval="0x0" description="Receive data in.This bit is effective in LIN or SCI-compatible mode. This bit contains the current value on the LINRX pin." range="1" rwaccess="R"/>
	</register><register id="LIN_SCIPIO3" acronym="LIN_SCIPIO3" offset="72" width="32" description="Pin control Register 3">
		<bitfield id="TXOUT" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin out.This bit is effective in LIN or SCI mode. This pin specifies the logic to be output on pin LINTX." range="2" rwaccess="R/W"/>
	<bitfield id="RXOUT" width="1" begin="1" end="1" resetval="0x0" description="Receive pin out.This bit is effective in LIN or SCI mode. This pin specifies the logic to be output on pin LINRX." range="1" rwaccess="R/W"/>
	</register><register id="LIN_SCIPIO4" acronym="LIN_SCIPIO4" offset="76" width="32" description="Pin control Register 4">
		<bitfield id="TXSET" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin set.This bit is effective in LIN or SCI mode. This bit sets the logic to be output on pin LINTX." range="2" rwaccess="R/W1TS"/>
	<bitfield id="RXSET" width="1" begin="1" end="1" resetval="0x0" description="Receive pin set.This bit is effective in LIN or SCI mode. This bit sets the logic to be output on pin LINRX." range="1" rwaccess="R/W1TS"/>
	</register><register id="LIN_SCIPIO5" acronym="LIN_SCIPIO5" offset="80" width="32" description="Pin control Register 5">
		<bitfield id="TXCLR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin clear.This bit is effective in LIN or SCI mode. This bit clears the logic to be output on pin LINTX." range="2" rwaccess="R/W1TC"/>
	<bitfield id="RXCLR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin clear.This bit is effective in LIN or SCI mode. This bit clears the logic to be output on pin LINRX." range="1" rwaccess="R/W1TC"/>
	</register><register id="LIN_SCIPIO6" acronym="LIN_SCIPIO6" offset="84" width="32" description="Pin control Register 6">
		<bitfield id="TXPDR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin open drain enable.This bit is effective in LIN or SCI mode. This bit enables open-drain capability in the output pin LINTX." range="2" rwaccess="R/W"/>
	<bitfield id="RXPDR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin open drain enable.This bit is effective in LIN or SCI mode. This bit enables open-drain capability in the output pin LINRX." range="1" rwaccess="R/W"/>
	</register><register id="LIN_SCIPIO7" acronym="LIN_SCIPIO7" offset="88" width="32" description="Pin control Register 7">
		<bitfield id="TXPD" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin pull control disable.This bit is effective in LIN or SCI mode. This bit disables pull control capability on the input pin LINTX." range="2" rwaccess="R/W"/>
	<bitfield id="RXPD" width="1" begin="1" end="1" resetval="0x0" description="Receive pin pull control disable.This bit is effective in LIN or SCI mode. This bit disables pull control capability on the input pin LINRX." range="1" rwaccess="R/W"/>
	</register><register id="LIN_SCIPIO8" acronym="LIN_SCIPIO8" offset="92" width="32" description="Pin control Register 8">
		<bitfield id="TXPSL" width="1" begin="2" end="2" resetval="0x1" description="TX pin pull select.This bit is effective in LIN or SCI mode. This bit selects pull type in the input pin LINTX." range="2" rwaccess="R/W"/>
	<bitfield id="RXPSL" width="1" begin="1" end="1" resetval="0x1" description="RX pin pull select.This bit is effective in LIN or SCI mode. This bit selects pull type in the input pin LINRX." range="1" rwaccess="R/W"/>
	</register><register id="LIN_LINCOMP" acronym="LIN_LINCOMP" offset="96" width="32" description="The LINCOMPARE register is used to configure the sync delimeter and sync break extension.">
		<bitfield id="SDEL" width="2" begin="9" end="8" resetval="0x0" description="2-bit Sync Delimiter compare.These bits are effective in LIN mode only. These bits are used to configure the number of Tbit for the sync delimiter in the sync field.The time delay calculation for the synchronization delimiter is:TSDEL = [SDEL + 1]Tbit These bits are writable in LIN mode only. 0      The sync delimiter has 1 Tbit.1      The sync delimiter has 2 Tbit.2      The sync delimiter has 3 Tbit.3      The sync delimiter has 4 Tbit." range="9:8" rwaccess="R/W"/>
	<bitfield id="SBREAK" width="3" begin="2" end="0" resetval="0x0" description="3-bit Sync Break extend.LIN mode only. These bits are used to configure the number of Tbits for the sync break to extend the minimum 13 Tbit in the Sync Field to a maximum of 20 Tbit.The time delay calculation for the sync break is:TSYNBRK = 13Tbit + SBREAK x Tbit These bits are writable in LIN mode only. 0      The sync break has no additional Tbit.1      The sync break has 1 additional Tbit.2      The sync break has 2 additional Tbit.3      The sync break has 3 additional Tbit.4      The sync break has 4 additional Tbit.5      The sync break has 5 additional Tbit.6      The sync break has 6 additional Tbit.7      The sync break has 7 additional Tbit." range="2:0" rwaccess="R/W"/>
	</register><register id="LIN_LINRD0" acronym="LIN_LINRD0" offset="100" width="32" description="The LINRD0 register contains the lower 4 bytes of the received LIN frame data.">
		<bitfield id="RD0" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 0Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received.A read of this byte clears the RXDY byte.Note: RD&#60;x-1> is equivalent to Data byte &#60;x> of the LIN frame." range="31:24" rwaccess="R"/>
	<bitfield id="RD1" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 1.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23:16" rwaccess="R"/>
	<bitfield id="RD2" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 2.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15:8" rwaccess="R"/>
	<bitfield id="RD3" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 3.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7:0" rwaccess="R"/>
	</register><register id="LIN_LINRD1" acronym="LIN_LINRD1" offset="104" width="32" description="The LINRD1 regsiter contains the upper 4 bytes of the received LIN frame data.">
		<bitfield id="RD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 4 Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="31:24" rwaccess="R"/>
	<bitfield id="RD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 5.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23:16" rwaccess="R"/>
	<bitfield id="RD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 6.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15:8" rwaccess="R"/>
	<bitfield id="RD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 7.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7:0" rwaccess="R"/>
	</register><register id="LIN_LINMASK" acronym="LIN_LINMASK" offset="108" width="32" description="The LINMASK register is used to configure the masks used for filtering incoming ID messages for receive and transmit frames.">
		<bitfield id="RXIDMASK" width="8" begin="23" end="16" resetval="0x0" description="Receive ID mask.This field is effective in LIN mode only.This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID witht the RX ID mask will set the ID RX flag and trigger and ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that that bit is filtered and therefore not used in the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="23:16" rwaccess="R/W"/>
	<bitfield id="TXIDMASK" width="8" begin="7" end="0" resetval="0x0" description="Transmit ID mask.This field is effective in LIN mode only. This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID with the TX ID Mask will set the ID TX flag and trigger an ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that bit is filtered and therefore not used for the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="7:0" rwaccess="R/W"/>
	</register><register id="LIN_LINID" acronym="LIN_LINID" offset="112" width="32" description="The LINID register contains the identification fields for LIN communication.NOTE: For software compatibility with future LIN modules, the HGEN CTRL bit must be set to 1, the RX ID MASK field must be set to FFh, and the TX ID MASK field must be set to FFh.">
		<bitfield id="RECEIVEDID" width="8" begin="23" end="16" resetval="0x0" description="Received ID.This bit is effective in LIN mode only. This byte contains the current message identifier. During header reception the received ID is copied from the SCIRXSHF register to this byte if there is no ID-parity error and there has been an RX/TX match.Note: If a framing error [FE] is detected during ID reception, the received ID will also not be copied to the LINID register." range="23:16" rwaccess="R"/>
	<bitfield id="IDSLAVETASKBYTE" width="8" begin="15" end="8" resetval="0x0" description="ID Target Task byte.This field is effective in LIN mode only. This byte contains the identifier to which the received ID of an incoming header will be compared in order to decide whether a RX response, a TX response, or no action needs to be done by the LIN node.  These bits are writable in LIN mode only." range="15:8" rwaccess="R/W"/>
	<bitfield id="IDBYTE" width="8" begin="7" end="0" resetval="0x0" description="ID byte.This field is effective in LIN mode only. This byte is the LIN mode message ID. On a master node, a write to this register by the CPU initiates a header transmission. For a target task, this byte is used for message filtering when HGENCTRL [SCIGCR1.12] is '0'. These bits are writable in LIN mode only." range="7:0" rwaccess="R/W"/>
	</register><register id="LIN_LINTD0" acronym="LIN_LINTD0" offset="116" width="32" description="The LINTD0 register contains the lower 4 bytes of the data to be transmitted.NOTE: TD&#60;x-1> is equivalent to Data byte &#60;x> of the LIN frame.">
		<bitfield id="TD0" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 0.Byte 0 to be transmitted is written into this register and then copied to SCITXSHF for transmission. Once byte 0 is written in TDO buffer, transmission will be initiated." range="31:24" rwaccess="R/W"/>
	<bitfield id="TD1" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 3.Byte 1 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="23:16" rwaccess="R/W"/>
	<bitfield id="TD2" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 2.Byte 2 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15:8" rwaccess="R/W"/>
	<bitfield id="TD3" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 3.Byte 3 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7:0" rwaccess="R/W"/>
	</register><register id="LIN_LINTD1" acronym="LIN_LINTD1" offset="120" width="32" description="The LINTD1 register contains the upper 4 bytes of the data to be transmitted.NOTE: TD&#60;x-1> is equivalent to Data byte &#60;x> of the LIN frame.">
		<bitfield id="TD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 4.Byte4 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="31:24" rwaccess="R/W"/>
	<bitfield id="TD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 5.Byte 5 to be transmitted is written into this register and then copied to SCITXSHF for transmission. " range="23:16" rwaccess="R/W"/>
	<bitfield id="TD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 6.Byte 6 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15:8" rwaccess="R/W"/>
	<bitfield id="TD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 7.Byte 7 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7:0" rwaccess="R/W"/>
	</register><register id="LIN_MBRSR" acronym="LIN_MBRSR" offset="124" width="32" description="The MBRSR register is used to configure the expected maximum baud rate of the LIN network.">
		<bitfield id="MBR" width="13" begin="12" end="0" resetval="0x3500" description="Maximum Baud Rate Prescaler.This field is effective in LIN mode only. This 13-bit prescaler is used during the synchronization phase [see the 'Header Reception and Adaptive Baudrate' section] of a target module if the ADAPT bit is set. In this way, a SCI/LIN target using an automatic or select bit rate modes detects any LIN bus legal rate automatically. The MBR value should be programmed to allow a maximum baud rate that is not more than 10% above the expected operating baud rate in the LIN network. Otherwise a s 0x00 data byte could mistakenly be detected as sync break.The default value is for a 70MHz LINCLK [0xDAC].This MBR prescaler is used by the wake-up and idle time counters for a constant expiration time relative to a 20kHz rate." range="12:0" rwaccess="R/W"/>
	</register><register id="LIN_RESERVED_1_j" acronym="LIN_RESERVED_1_j" offset="128" width="32" description="tbd.">
		</register><register id="LIN_IODFTCTRL" acronym="LIN_IODFTCTRL" offset="144" width="32" description="The IODFTCTRL register is used to emulate various error and test conditions.">
		<bitfield id="BERRENA" width="1" begin="31" end="31" resetval="0x0" description="Bit Errror Enable bit.This bit is effective in LIN mode only. This bit is used to create a Bit error. When this bit is set, the bit received is ORed with 1 and passed to the Bit monitor circuitry." range="31" rwaccess="R/W"/>
	<bitfield id="PBERRENA" width="1" begin="30" end="30" resetval="0x0" description="Physical Bus Error Enable bit.This bit is effective in LIN mode only. This bit is used to create a Physical Bus Error. When this bit is set, the bit received during Sync Break field transmission is ORed with 1 and passed to the Bit monitor circuitry" range="30" rwaccess="R/W"/>
	<bitfield id="CERRENA" width="1" begin="29" end="29" resetval="0x0" description="Checksum Error Enable bit.This bit is effective in LIN mode only. This bit is used to create a checksum error. When this bit is set, the polarity of the CTYPE [checksum type] in the receive checksum calculator is changed so that a checksum error is generated." range="29" rwaccess="R/W"/>
	<bitfield id="ISFERRENA" width="1" begin="28" end="28" resetval="0x0" description="Inconsistent Sync Field Error Enable bit.This bit is effective in LIN mode only. This bit is used to create an ISF error. When this bit is set, the bit widths in the sync field are varied so that the ISF check fails and the error flag is set." range="28" rwaccess="R/W"/>
	<bitfield id="FERRENA" width="1" begin="26" end="26" resetval="0x0" description="This bit is used to create a Frame Error.This bit is effective in SCI-compatible mode only. When this bit is set, the stop bit received is ANDed with '0' and passed to the stop bit check circuitry." range="26" rwaccess="R/W"/>
	<bitfield id="PERRENA" width="1" begin="25" end="25" resetval="0x0" description="Compatible Mode onlyThis bit is effective in SCI-compatible mode only. This bit is used to create a Parity Error. When this bit is set, in compatible mode, the parity bit received is toggled so that a parity error occurs." range="25" rwaccess="R/W"/>
	<bitfield id="BRKDTERRENA" width="1" begin="24" end="24" resetval="0x0" description="Compatible Mode onlyThis bit is effective in SCI-compatible mode only. This bit is used to create BRKDT error [SCI mode only]. When this bit is set, the stop bit of the frame is ANDed with '0' and passed to the RSM so that a frame error occurs. Then the RX Pin is forced to continuous low for 10 Tbits so that a BRKDT error occurs." range="24" rwaccess="R/W"/>
	<bitfield id="PINSAMPLEMASK" width="2" begin="20" end="19" resetval="0x0" description="Pin sample mask.These bits define the sample number at which the TX Pin value that is being transmitted will be inverted to verify the receive pin samples correctly with the majority detection circuitry.Note: During IODFT mode testing for the pin sample mask, the prescalar P must be programmed to be greater than 2. 0      No Mask1      Invert the TX Pin value at TBIT_CENTER2      Invert the TX Pin value at TBIT_CENTER +       SCLK3      Invert the TX Pin value at TBIT_CENTER + 2       SCLK" range="20:19" rwaccess="R/W"/>
	<bitfield id="TXSHIFT" width="3" begin="18" end="16" resetval="0x0" description="Transmit shift.These bits define the delay by which the value on LINTX is delayed so that the value on LINRX is asynchronous. [Not applicable to Start Bit] 0      No Delay1      Delay by 1 SCLK2      Delay by 2 SCLK3      Delay by 3 SCLK4      Delay by 4 SCLK5      Delay by 5 SCLK6      Delay by 6 SCLK7      Delay by 7 SCLK" range="18:16" rwaccess="R/W"/>
	<bitfield id="IODFTENA" width="4" begin="11" end="8" resetval="0x5" description="IO DFT Enable KeyThis field is used to enable the IODFT mode of the SCI/LIN module for testing.  0      IODFT is disabled1      IODFT is disabled2      IODFT is disabled3      IODFT is disabled4      IODFT is disabled5      IODFT is disabled6      IODFT is disabled7      IODFT is disabled8      IODFT is disabled9      IODFT is disabled10     IODFT is enabled11     IODFT is disabled12     IODFT is disabled13     IODFT is disabled14     IODFT is disabled15     IODFT is disabled" range="11:8" rwaccess="R/W"/>
