ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/LIN_LIN_52400000h.xml
	<bitfield id="LPBENA" width="1" begin="1" end="1" resetval="0x0" description="Module loopback enable.In analog loopback mode the complete communication path through the I/Os can be tested, whereas in digital loopback mode the I/O buffers are excluded from this path. 0      Digital loopback is enabled.1      Analog loopback is enabled in module I/O       DFT mode (when IODFTENA = 1010)" range="1" rwaccess="R/W"/>
	<bitfield id="RXPENA" width="1" begin="0" end="0" resetval="0x0" description="Module Analog loopback through receive pin enable.This bit defines whether the I/O buffers for the transmit or the receive pin are included in the communication path in analog loopback mode only. 0      Analog loopback through the transmit pin is       enabled.1      Analog loopback through the receive pin is       enabled." range="0" rwaccess="R/W"/>
	</register><register id="LIN_RESERVED_2_j" acronym="LIN_RESERVED_2_j" offset="148" width="32" description="tbd.">
		</register><register id="LIN_LIN_GLB_INT_EN" acronym="LIN_LIN_GLB_INT_EN" offset="224" width="32" description="The LIN_GLB_INT_EN register is used to enable the INT0 and INT1 interrupt lines to propagate to the PIE block.">
		<bitfield id="GLBINT1_EN" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt Enable for LIN INT1.This bit determines whether the INT1 interrupt line generates an interrupt to the PIE or not 0      LIN INT1 line does not generate an       interrupt to the PIE.1      LIN INT1 line generates an interrupt to the       PIE if an enabled interrupt condition       occurs." range="1" rwaccess="R/W"/>
	<bitfield id="GLBINT0_EN" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Enable for LIN INT0.This bit determines whether the INT0 interrupt line generates an interrupt to the PIE or not. 0      LIN INT0 line does not generate an       interrupt to the PIE.1      LIN INT0 line generates an interrupt to the       PIE if an enabled interrupt condition       occurs." range="0" rwaccess="R/W"/>
	</register><register id="LIN_LIN_GLB_INT_FLG" acronym="LIN_LIN_GLB_INT_FLG" offset="228" width="32" description="The LIN_GLB_INT_FLG register contains the current status of the INT0 and INT1 flags.">
		<bitfield id="INT1_FLG" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt Flag for LIN INT1.This bit indicates if an interrupt was generated to the PIE due to an enabled interrupt on the INT1 interrupt line. Refer to the LIN Interrupt Status Register for the condition that generated the interrupt.This bit can be cleared by Writing a 1 to the corresponding bit in the LIN_GLB_INT_CLR register. 0      No interrupt is active on the INT1 line.1      An interrupt was generated due to an       enabled interrupt on the INT1 interrupt       line." range="1" rwaccess="R"/>
	<bitfield id="INT0_FLG" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Flag for LIN INT0.This bit indicates if an interrupt was generated to the PIE due to an enabled interrupt on the INT0 interrupt line. Refer to the LIN Interrupt Status Register for the condition that generated the interrupt.This bit can be cleared by Writing a 1 to the corresponding bit in the LIN_GLB_INT_CLR register. 0      No interrupt is active on the INT0 line.1      An interrupt was generated due to an       enabled interrupt on the INT0 interrupt       line." range="0" rwaccess="R"/>
	</register><register id="LIN_LIN_GLB_INT_CLR" acronym="LIN_LIN_GLB_INT_CLR" offset="232" width="32" description="The LIN_GLB_INT_CLR register is used to clear the interrupt flags in LIN_GLB_INT_FLG register.">
		<bitfield id="INT1_FLG_CLR" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt flag clear for LIN INT1.This bit is used to clear the corresponding bit in the LIN_GLB_INT_FLG register. Write 1 to clear the INT1_FLG bit. Writing 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="INT0_FLG_CLR" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt flag clear for LIN INT0.This bit is used to clear the corresponding bit in the LIN_GLB_INT_FLG register. Write 1 to clear the INT0_FLG bit. Writing 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register>
</module>